let textList = [
    '1553239587-内存管理+如何处理常见的内存泄露-内存',
    '1553240709-防抖+节流+url+页面渲染-基础',
    '1553240927-网页解析的全过程(输入url到展示页面)-基础',
    '1553240896-浏览器渲染页面过程剖析-基础',
    '1553240795-闲聊JS中的apply和call-基础',
    '1553250972-实现双向绑定Proxy比defineproperty优劣如何-vue',
    '1553247837-百度地图与腾讯高德地图经纬度转换-坐标定位',
    '1553298946-CSS小技巧让你少写不必要的JS-css',
    '1553298661-CSS布局方案-css',
    '1553298343-https连接的前几毫秒发生了什么-原理',
    '1553298131-能使用html+css解决的问题就不要使用JS-性能优化',
    '1553297714-css3性能-css',
    '1553297497-奇妙的CSSshapes(CSS图形)-css',
    '1553260737-拖放API实现拖放排序-html5',
    '1553252296-HTML5-进阶系列-文件上传下载-html5'
];